      * Book para o programa PROG0003.cbl
       01 PROG0003-BOOK.
           03 PROG0003-REQUEST.
               05 PROG0003-NAME           PIC X(10).
           03 PROG0003-CONTROL.
               05 PROG0003-RTN-CODE       PIC 9(04).
               05 PROG0003-MSG            PIC X(255).
               05 PROG0003-EXP-MSG        PIC X(255).