       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG0003.
       
       DATA DIVISION.
       
       WORKING-STORAGE SECTION.

       LINKAGE SECTION.
       COPY 'books/PROG0003.cpy'.

       PROCEDURE DIVISION USING PROG0003-BOOK.
           DISPLAY "PROG0003-NAME: " PROG0003-NAME    
           GOBACK.